In [1]:
import pandas as pd 
import numpy as np
frame=pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['kaduna','cross river','Taraba','imoh'])
frame

                    b         d         e
kaduna      -0.349429 -0.069121  0.475663
cross river -0.005154  0.640695  1.573053
Taraba      -0.854257 -0.245524  0.753797
imoh        -1.403389 -1.076304  0.907094

In [2]:
np.abs(frame)

                    b         d         e
kaduna       0.349429  0.069121  0.475663
cross river  0.005154  0.640695  1.573053
Taraba       0.854257  0.245524  0.753797
imoh         1.403389  1.076304  0.907094

In [3]:
f=lambda x:x.max()-x.min()
frame.apply(f)

b    1.398235
d    1.716999
e    1.097390
dtype: float64

In [7]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

            b         d         e
min -1.403389 -1.076304  0.475663
max -0.005154  0.640695  1.573053

In [9]:
form=lambda x: '%.2f'%x
frame.applymap(form)

                 b      d     e
kaduna       -0.35  -0.07  0.48
cross river  -0.01   0.64  1.57
Taraba       -0.85  -0.25  0.75
imoh         -1.40  -1.08  0.91

In [10]:
frame['d'].map(form)

kaduna         -0.07
cross river     0.64
Taraba         -0.25
imoh           -1.08
Name: d, dtype: object

In [11]:
obj = pd.Series(range(4),index=['d','g','h','f'])
obj.sort_index()

d    0
f    3
g    1
h    2
dtype: int64

In [13]:
sipet=pd.DataFrame(np.arange(8).reshape(2,4),columns=list('cbda'),index=['min','max'])
sipet

     c  b  d  a
min  0  1  2  3
max  4  5  6  7

In [14]:
sipet.sort_index()

     c  b  d  a
max  4  5  6  7
min  0  1  2  3

In [15]:
sipet.sort_index(axis=1)

     a  b  c  d
min  3  1  0  2
max  7  5  4  6

In [16]:
sipet.sort_index(axis=1,ascending=False)

     d  c  b  a
min  2  0  1  3
max  6  4  5  7

In [20]:
#sorting a series by its its value order
series=pd.Series([4,5,-2,8],index=Order())

NameError: name 'Order' is not defined